app/views/institutions/show.html.erb

SELECT "course_options".* FROM "course_options" WHERE "course_options"."institution_id" = ?  [["institution_id", 186764780]]
SELECT "courses".* FROM "courses" INNER JOIN "course_options" ON "courses"."id" = "course_options"."course_id" WHERE "course_options"."institution_id" = ?  [["institution_id", 186764780]]
SELECT COUNT(*) FROM "course_options" WHERE "course_options"."institution_id" = ?  [["institution_id", 186764780]]
SELECT COUNT(*) FROM "courses" INNER JOIN "course_options" ON "courses"."id" = "course_options"."course_id" WHERE "course_options"."institution_id" = ?  [["institution_id", 186764780]]
---
<p>Courses offered by this Institution</p>
<% if @institution.course_options.size > 0 %>