app/views/applications/_form.html.erb

		<%= f.label :student_id %>
		<%= f.collection_select(:student_id, Student.all.order('first_name,last_name'), :id, :to_s, prompt: true) %>
---
SELECT "students".* FROM "students"  ORDER BY first_name,last_name

		<%= f.label :course_option_id %>
		<%= f.collection_select(:course_option_id, CourseOption.all.order('intake_date'), :id, :course_name, prompt: true) %>
---
SELECT "course_options".* FROM "course_options"  ORDER BY intake_date