app/views/applications/index.html.erb


<p><%= pluralize(@applications.count, "application".capitalize) %> found</p>
---
SELECT "applications".* FROM "applications"