app/views/course_options/_form.html.erb

SELECT "institutions".* FROM "institutions"
---
		<%= f.label :institution_id %>
		<%= f.collection_select(:institution_id, Institution.all, :id, :name, prompt: true) %>

SELECT "courses".* FROM "courses"
---
		<%= f.label :course_id %>
		<%= f.collection_select(:course_id, Course.all, :id, :name, prompt: true) %>