app/views/courses/index.html.erb

SELECT "courses".* FROM "courses"
---
<h2>Courses</h2>
<p><%= pluralize(@courses.count, "course".capitalize) %> found</p>