app/views/courses/show.html.erb


<% if @course.course_options.size > 0 %>
---
SELECT "course_options".* FROM "course_options" WHERE "course_options"."course_id" = ? AND (intake_date > #{Time.now})  ORDER BY intake_date  [["course_id", 148074040]]
SELECT COUNT(*) FROM "course_options" WHERE "course_options"."course_id" = ?  [["course_id", 148074040]]