app/controllers/applications_controller.rb

SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 18163554]]
---
	def show
		@application = Application.find(params[:id])

SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 18163554]]
---
	def edit
		@application = Application.find(params[:id])

SELECT  "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT 1  [["id", 18163554]]
UPDATE "applications" SET "start_date" = ?, "payment_due_date" = ?, "payment_date" = ?, "updated_at" = ? WHERE "applications"."id" = ?
---
	def update
		@application = Application.find(params[:id])
		if @application.update(params[:application].permit(:student_id, :course_option_id, :start_date, :payment_due_date, :payment_date))