app/controllers/course_options_controller.rb

	def index
		@course_options = CourseOption.all.order('intake_date')
---
SELECT "course_options".* FROM "course_options"  ORDER BY intake_date

	def show
		@course_option = CourseOption.find(params[:id])
---
SELECT  "course_options".* FROM "course_options" WHERE "course_options"."id" = ? LIMIT 1  [["id", 2416600]]

	def create
		@course_option = CourseOption.new(params[:course_option].permit(:institution_id, :course_id, :duration, :cost, :capacity, :intake_date, :more_information))
		if @course_option.save
---
INSERT INTO "course_options" ("institution_id", "course_id", "duration", "cost", "capacity", "more_information", "intake_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

	def edit
		@course_option = CourseOption.find(params[:id])
---
SELECT  "course_options".* FROM "course_options" WHERE "course_options"."id" = ? LIMIT 1  [["id", 2416600]]

	def update
		@course_option = CourseOption.find(params[:id])
		if @course_option.update(params[:course_option].permit(:institution_id, :course_id, :duration, :cost, :capacity, :intake_date, :more_information))
---
SELECT  "course_options".* FROM "course_options" WHERE "course_options"."id" = ? LIMIT 1  [["id", 1067781091]]
UPDATE "course_options" SET "cost" = ?, "updated_at" = ? WHERE "course_options"."id" = ?  [["cost", 550], ["updated_at", "2015-10-09 07:34:25.158227"], ["id", 1067781091]]