app/controllers/courses_controller.rb

	def index
		@courses = Course.all.paginate(:page => params[:page])
---
SELECT "courses".* FROM "courses"

	def create
		@course = Course.new(params[:course].permit(:name, :description))
		if @course.save
---
INSERT INTO "courses" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Diploma Web Developer"], ["description", "Developer Course"], ["created_at", "2015-10-09 06:44:18.876944"], ["updated_at", "2015-10-09 06:44:18.876944"]]

	def update
		@course = Course.find(params[:id])
		if @course.update(params[:course].permit(:name, :description))
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 148074040]]
UPDATE "courses" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["name", "Diploma of Business xxx"], ["description", "Description about this course xxxx"], ["updated_at", "2015-10-09 06:41:37.140921"], ["id", 148074040]]