app/controllers/institutions_controller.rb

	def index
		@institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"

	def show
		#render nothing: true
		@institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 186764780]]

	def create
		@institution = Institution.new(params[:institution].permit(:name, :website, :enrolment_fee))
		if @institution.save
---
INSERT INTO "institutions" ("name", "website", "enrolment_fee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "AIT"], ["website", "www.ait.nsw.edu.au"], ["enrolment_fee", 200], ["created_at", "2015-10-09 07:37:27.198586"], ["updated_at", "2015-10-09 07:37:27.198586"]]

	def edit
		@institution = Institution.find(params[:id])
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 186764780]]

	def update
		@institution = Institution.find(params[:id])
		if @institution.update(params[:institution].permit(:name, :website, :enrolment_fee))
---
SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 186764780]]
UPDATE "institutions" SET "website" = ?, "enrolment_fee" = ?, "updated_at" = ? WHERE "institutions"."id" = ?  [["website", "www"], ["enrolment_fee", 0], ["updated_at", "2015-10-09 05:56:00.809805"], ["id", 926897144]]