app/controllers/students_controller.rb

	def create
		@student = Student.new(params[:student].permit(:first_name, :last_name, :email, :phone, :date_birth))
		if @student.save
---
INSERT INTO "students" ("first_name", "last_name", "email", "phone", "date_birth", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		@student = Student.find(params[:id])
		if @student.update(params[:student].permit(:first_name, :last_name, :email, :phone, :date_birth))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 830138775]]
UPDATE "students" SET "email" = ?, "phone" = ?, "date_birth" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["email", "solange@teste.com.au"], ["phone", "0450 "], ["date_birth", "2015-10-05 00:00:00.000000"], ["updated_at", "2015-10-09 10:25:33.147282"], ["id", 830138775]]